# FailToIntersectParallelSegmentsWarning Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AutoRouteFailures..::..FailToIntersectParallelSegmentsWarning Property
BuiltInFailures..::..AutoRouteFailures Class See Also
---
The solution is failing to do segments which are parallel and should intersect.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FailToIntersectParallelSegmentsWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FailToIntersectParallelSegmentsWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FailToIntersectParallelSegmentsWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AutoRouteFailures Class
Autodesk.Revit.DB Namespace